Revit 2027 API
AreaReinforcement.IsLayerActive Method
 Identifies if the layer is active or not.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsLayerActive(
	AreaReinforcementLayerType layer
)
Public Function IsLayerActive (
	layer As AreaReinforcementLayerType
) As Boolean
public:
bool IsLayerActive(
	AreaReinforcementLayerType layer
)
member IsLayerActive :
        layer : AreaReinforcementLayerType -> bool
Parameters
layer AreaReinforcementLayerType
 The layer that will be tested.
Return Value
Boolean
 Returns true if the input layer is active, false otherwise
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
AreaReinforcement Class
Autodesk.Revit.DB.Structure Namespace